# 데이터프레임 연산

In [22]:
import pandas as pd
df = pd.DataFrame({'col1': [1, 2, 3, 4],
                   'col2': [444, 555, 666, 444],
                   'col3': ['abc', 'def', 'ghi', 'xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### (1) 컬럼에서 중복되지 않은 값 가져오기

In [3]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [5]:
# unique한 값의 갯수 
df['col2'].nunique()

3

In [7]:
# 컬럼의 각 값의 갯수
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

### (2) 데이터 선택

In [9]:
# 여러개의 컬럼으로 조건을 지정해서 데이터프레임의 값 선택,
newdf = df[(df['col1']>2) & (df['col2']==444)]
newdf

   col1  col2 clo3
3     4   444  xyz

## 2. 함수 적용하기

In [10]:
def times2(x):
    return x*2

In [11]:
df['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [12]:
#함수 적용하기 : apply()
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [23]:
# 데이터프레임 내장 함수 apply
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [24]:
df['col1'].sum()

10

In [25]:
# 컬럼 삭제하기
del df['col1']

In [26]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

## 3. 데이터프레임의 구성요소 알아보기

### (1) 데이터프레임의 컬럼명 리스트 출력

In [27]:
df.columns

Index(['col2', 'col3'], dtype='object')

### (2) 인덱스 출력

In [28]:
df.index

RangeIndex(start=0, stop=4, step=1)

### (3) 정렬

In [30]:
# inplace의 기본값은 False
df.sort_values(by = 'col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

## 4. 잘못된 값 찾기

### (1) null값 찾기

In [31]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

### (2) NaN 값 찾아서 삭제

In [33]:
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [35]:
import numpy as np
df = pd.DataFrame({'col1': [1, 2, 3, np.nan],
                   'col2': [np.nan, 555, 666, 444],
                   'col3': ['abc', 'def', 'ghi', 'xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [36]:
df.fillna('FILL')

   col1   col2 col3
0   1.0   FILL  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3  FILL  444.0  xyz

In [39]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}
df = pd.DataFrame(data)

In [40]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [45]:
df.pivot_table(values='D', index = ['A', 'B'], columns = ['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN